
{
  //SPECIAL DIALOGUE
  "Introduction": "Oh, my! Aren't you a cutie. Welcome to the valley, dear.$4#$b#It's so exciting when someone new moves in!$1#$e#Have you met my son, Victor?$3",
  
  //JOJA JOB QUESTION
  "spring_Thu": "Working at Joja as an accounting manager was a different chapter of my life.$0#$q 8001/8002 joja_followup#Didn't you used to work for Joja as an accountant?#$r 8001 50 joja_yes#Yes, I used to work in the accounting department.#$r 8002 -50 joja_no#No. I never worked at Joja. You are mistaken.",
  "joja_yes": "Hmm, that's what I thought. Mayor Lewis told me you did.$6#$b#Isn't it incredible you went from accounting into farming? I started stock trading. It's somewhat relatable to accounting.$1#$b#It feels so much freer to not be tied up in a corporate office, able to do work you love.$3#$b#I'm happy you found your passion, sweetie.$4",
  "joja_no": "That's strange. That isn't what Morris and Mayor Lewis told me...$6",
  "joja_followup": "$p 8001#It was for you too, sweetie. I'm happy we were both able to move on.$3|It was for you too, sweetie. I'm happy we were both able to move on.$3",
  
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "JenkinsHouse_16_12": "%Olivia is busy being artistic.",
  "JenkinsHouse_20_9": "%Olivia is concentrating on her yoga form.",
  "JenkinsHouse_18_5": "Get out of my bedroom! Now!$5",
  "JenkinsHouse4_18_5": "Hi, dear. Can't you see I'm still in bed?$0",
  "JenkinsHouse8_18_5": "Hello, sweetie. I'm in bed right now. Come back another time.$3",
  "JenkinsHouse_5_8": "@, I'm using the restroom! Leave!$5",
  "JenkinsHouse4_5_8": "Umm... @! I'm in the restroom!$4#$b#Leave!$5",
  "JenkinsHouse9_5_8": "Umm... Now isn't the best time to chat, honey. I'll be out of the restroom soon.$0",
  "SeedShop_20_20": "%Olivia is concentrating on her yoga form.",

  //GENERIC DIALOGUE
  "Mon": "I wonder if any of Victor's friends want a part time job cleaning the house. It'd save me a lot of time.$4",
  "Mon2": "I fit Caroline and Jodi into my busy schedule on Mondays and Thursdays. They are both dear friends of mine.$3#$b#I try my best to stay away from Pam. She doesn't sit well with me.$2#$e#Oh, why? Dear, that's none of your business.$1",
  "Mon6": "I'm debating if I should hire a landscaper. The backyard could use some attention.$6#$e#You want to talk more? I'm a busy at the moment, dear.$0",
  "Mon10": "What a joyous day it is today, wouldn't you say?$1#$e#It’s a joy to see you, @.$3",
  "Tue": "Hello, dear. Having a productive day today? Don't overwork and hurt yourself.$3#$e#I wouldn't want you moving away so soon.$6",
  "Tue2": "I've been doing yoga for many years. I can do advanced poses such as 'Lord of the Dance' and 'Lotus'.$1#$e#Staying healthy is important if you want a beautiful, flawless body such as mine.$4",
  "Tue6": "I'm part of the aerobics class at Pierre's. Yoga is an excellent way to focus the mind and body.$3#$e#It also keeps me healthy and slim.$1",
  "Tue10": "Have you ever tried yoga, @? It's a physical, mental, and spiritual practice!$1#$e#Whenever you have some spare time, I'd love to teach you some yoga poses.$3",
  "Wed": "Hi, sweetie. Happy Wednesday.$3#$e#Maybe if you're lucky, I'll give you a taste of my extravagant wine.$1",
  "Wed2": "Victor needs to clean his room soon. We're having guests over later.$0",
  "Wed6": "Hi, sweetie. Having a good Wednesday?$1#$e#We should drink some wine together sometime.$3",
  "Wed10": "I watered the plants in the house today. Healthy plants mean clean, fresh air in the house.$1#$e#It's not something money could buy.$3",
  "Thu": "Sorry, dear. I'm too busy to talk right now.$0#$e#That means you can leave, @.$6",
  "Thu2": "Hi, @! I'm in cheerful and lovely mood today!$3#$e#Why? Because I made a lot of money this morning through a stock trade.$1",
  "Thu6": "Will you be at the saloon tomorrow, @? You may see me there. Victor goes every Friday to hang out with his friends.$3",
  "Thu10": "It's a joy to see you, @. How are you?$3#$e#Ohh, I see! Staying productive as always. I'm happy to hear that!$1",
  "Fri": "Hello, dear. Happy Friday.$0#$e#You may leave now.$6#$e#%Olivia is ignoring you.",
  "Fri2": "I always indulge myself with a nice glass of wine on Fridays.$3#$b#Gus carries some rare vintage and wine from Blue Moon Vineyard.$1",
  "Fri6": "Some of my stocks decreased in value this morning. I lost 50,000G.$2#$e#%Olivia isn't in a good mood to talk.",
  "Fri10": "Happy Friday, sweetie! You've been working so hard lately! You deserve a day off.$3#$e#Let me know if I can get you anything.$1",
  "Sat": "There's always too much work to be done around the house. I may hire a butler soon.$6#$e#Have a nice day, dear.$3",
  "Sat2": "Painting is something I picked up several years ago. Leah has given me some pointers!$3#$e#She's truly a doll, wouldn't you say?$1",
  "Sat6": "Hi, honey. How is this Saturday treating you? You work too hard during the weekends.$3#$e#You should take a break every once in a while.$0",
  "Sat10": "I've been making so much progress on my art lately!$1#$e#Have a wonderful day, @!$3",
  "Sun": "You don't take days off, do you? I certainly don't want to distract you from your day.$0#$e#Go on ahead with your errands, @.$0", 
  "Sun2": "Time is money! You know this is true, @. I always check my stocks every day.$3#$e#Of course, you know this. It's the reason you never take a day off from working on your farm.$6",
  "Sun6": "With the money I made this morning from a stock trade, I believe I'll spend it on an extravagant painting from the Fern Islands.$1",
  "Sun10": "It's so wonderful to see you, sweetie! How is your day?$3#$e#If you ever need anything, don't hesitate to ask!$1",

  //SPRING DIALOGUE
  "spring_1": "I'm happy it's spring again. I was growing most tiresome of the winter weather.$3",
  "spring_2": "I've been doing yoga for many years. It's helped tone my body and concentrate my mind to a balanced state.$3#$e#Have you considered joining our workout group, @?$1",
  "spring_3": "I donated 25,000G to a charity in Zuzu City yesterday.$1#$b#I understand not everyone is as fortunate as I am. I try to help where I can.$2",
  "spring_5": "I bought some potted plants from Marnie. They're doing wonderful in the backyard.$1#$e#I'd get some chickens from her too, but I wouldn't have anywhere to put them.$2",
  "spring_6": "Andy made me feel uncomfortable at the saloon last night. He was staring at me constantly.$2#$e#I heard he's horrible at paying his tabs. That's not too surprising.$6",
  "spring_7": "If you ever want me to invest your money in stocks, I'll be happy to oblige, @.$1#$e#I will, however, charge a 20 percent fee for my expertise.$6",
  "spring_8": "I invested 125,000G in a startup company this morning. I have faith they're going to grow big!$1#$e#Tech companies are booming in Zuzu City.$3#$b#If you want to make easy money, now's the time to get into stocks, @.$4",
  "spring_9": "Yoga is a great activity if you have high blood pressure or high cholesterol.$1#$e#I think Andy could certainly use some yoga. Or at least a diet.$2",
  "spring_10": "I broke one of my Gotoro Empire dishes this morning. I have to spend 6,000G to replace it now...$2",
  "spring_12": "The Egg Festival is tomorrow! A good opportunity to indulge on my vintage wine.$4",
  "spring_14": "I tried making Victor do yoga with me and he refused to even try it.$6#$e#I suppose I'll need to wait until Tuesday. Emily loves joining me.$3",
  "spring_15": "Caroline had an argument with Pierre today and she vented on me.$2#$e#I hope she and Pierre are doing okay.$2#$b#They're both strong people. I know they'll get through this.$0",
  "spring_16": "The beauty of yoga is the enhanced flexibility it gives you, @.$4#$b#Working the fields on your farm will certainly tone you out a bit.$3",
  "spring_19": "Mayor Lewis was short 5,000G for the Egg Festival this year.$2#$b#I contributed my own money to insure we could still host the festival.$0#$e#In return, he allowed me to use more community kegs next to the community center.$4",
  "spring_20": "I tipped Emily 1,000G at the saloon last night. She's such a wonderful waitress!$1#$b#I feel like the Stardrop Saloon wouldn't be the same without her.$3",
  "spring_23": "Hi, honey. Spring is coming to an end soon. Do you know what crops you'll plant for summer?$4#$e#Marnie plants melons every year.$3",
  "spring_25": "Despite the fact I was an accounting manager at Joja, I never shop at their stores, and never will.$0#$e#Oh, why? Their products aren't healthy, and they'd damage my complexion.$6",
  "spring_27": "Caroline and Jodi are my best friends. We've been through so much together.$1#$e#The three of us are mothers. We see eye to eye on many things.$4",
  "spring_28": "I think I may grow sunflowers in the backyard this summer. They're my favorite flower.$1#$e#Sunflower seeds make a healthy snack too!$3",
  
  //SUMMER DIALOGUE
  "summer_1": "Ah, summer is here! I can finally show off my new bikini at the beach.$4",
  "summer_2": "I'm visiting Blue Moon Vineyard tomorrow. Sophia always has stocks of iridium quality wine.$1",
  "summer_3_1": "That was a horrible blast last night. Did that wake you up too, @?$0#$e#It sounded like dynamite blowing up. I need to talk to Mayor Lewis.$2",
  "summer_3": "Hi, honey. Here's some money for you! Go buy yourself some ice cream!$1[336]",
  "summer_4": "Hello, dear. What do you think of my new earrings? I just got these from Sautine City!$1",
  "summer_5": "Caroline, Jodi and I may go swimming sometime soon. Caroline has a new swimsuit from what I've heard.$4",
  "summer_8": "I received a hefty amount of junk mail this morning. I need to have a word with Mayor Lewis.$2#$e#Most of the mail I get are advertisements and scams.$5",
  "summer_9": "I think I'm going to try a different yoga routine. Something to challenge myself!$3",
  "summer_10": "The governor doesn't visit Stardew Valley that often. It's an honor he's visiting us tomorrow.$1#$e#I expect you'll be on your best behavior and contribute to the soup.$3",
  "summer_12": "%Olivia seems preoccupied at the moment.",
  "summer_13": "Next time I get back from the Fern Islands, I'll bring some ring fruit for you.$1#$b#They're delicious and make the perfect ingredient for a variety of desserts!$4",
  "summer_14": "I'm in the middle of reading a romance novel. It's one of my favorite genres.$1#$e#Have a wonderful day, dear.$3",
  "summer_15": "I picked up some fresh produce from Pierre this morning. He always has the best organics.$3#$e#Here's a melon! This is fresh from Marnie's crop field.$4[254]",
  "summer_17": "Leah taught me some high-level brush stroke techniques. I envy her artistic skills.$3#$e#If I apply myself more, I believe I'll get to her level eventually!$1",
  "summer_18": "I was meaning to tell Sophia her latest batch of iridium quality wine is the best yet.$0#$b#I can't find her anywhere. @, would you happen to know where Sophia is?$2",
  "summer_19": "Jodi told me Vincent isn't doing so well in math. She has so much on her plate.$2#$e#It'd make Jodi happy if you gave her some of your produce or animal products, @.$3",
  "summer_20": "Hello, dear. How's your day?$3#$e#Oh. Me? My day is going well. Thank you for asking.$1#$e#Has anyone ever told you that you're very polite?$4",
  "summer_22": "Hi, sweetie. You're working so hard today, and in this summer heat too!$2#$e#Take this soda. It'll hydrate you.$4[167]",
  "summer_23": "I may take a trip to Grampleton soon. The perfect weather you'll ever experience is under the shade of the tall red wood trees.$3#$e#Until we meet next time, honey.$1",
  "summer_25": "Susan gave me a freshly picked melon from her crop field today. She's an absolute sweetheart!$1#$b#Her crops are much healthier than Andy's.$4#$e#I don't think I'd ever eat one of his crops.$2",
  "summer_27": "I saw Linus looking for forage in town last night during a late-night stroll.$0#$b#I felt... bad for him. I offered him 3,000G and he turned it down.$2#$e#He looks... strangely familiar. I don't know why.$6",
  "summer_28": "Will you be joining everyone to watch the moonlight jellies tonight, @?$3",
  
  //FALL DIALOGUE
  "fall_1": "Good luck on your fall harvest this year, @. If you sell any pumpkins to Pierre, I may purchase some!$4",
  "fall_2": "My seamstress in Chestervale designed the most beautiful dress for me.$1#$b#I'm looking forward to wearing it at the next town festival.$4#$e#Have a nice day, dear.$3",
  "fall_3": "You're working so hard, sweetie! This energy tonic from doctor Harvey will help you get your energy back.[349]$4#$e#Have a wonderful day, sweetie!$1",
  "fall_4": "Jodi baked me an apple pie yesterday! It was delicious! I need to make her something special too.$1",
  "fall_5": "I prefer red wine over white wine. It has a higher amount of minerals and vitamins.$3#$e#Sophia specializes in red wine fermentation.$1",
  "fall_8": "During fall, I may sometimes take trips in the forest to gather some mushrooms.$0#$b#I wish Victor enjoyed mushrooms as much as I did. I'd use them in just about every dish.$2",
  "fall_9": "It's such a shame all Gotoro Empire exports are banned. The country has exquisite art and wine.$2#$e#I hope this trivial war with them ends soon...$2",
  "fall_11": "%Olivia notices you, but doesn't say anything.",
  "fall_12": "Pierre makes high quality spiced cider during fall. He doesn't sell it at the front counter.$4#$e#He only sells it to his closest friends. Caroline and I have an excellent relationship.$4",
  "fall_13": "I saw %pet walking around town yesterday. Such an adorable animal!$1#$e#%pet reminds me of Dewey... Victor loved that cat so much.$2",
  "fall_15": "You're participating in the fair tomorrow, sweetie? I wish you the best of luck!$3#$e#Pierre's crops have been doing very well this year. It'll be a close call between you two.$3",
  "fall_17": "At the fair yesterday, I spoke with a tourist that came all the way from Pine-Mesa City!$1#$b#You're from Pine-Mesa City, right @? It's not as big as Zuzu City, but it's still bustling with activity and commerce.$3",
  "fall_19": "Such a chilly fall day.$3#$e#Ciao, @.$4",
  "fall_20": "Marlon walked into the saloon with the wizard last night and they both went to the back room.$6#$b#Some other figure with a brown cloak joined them in that room.$0#$e#I wonder what was going on back there.$6",
  "fall_23": "Mayor Lewis is considering putting funding into the dock repairs. They're quite old.$0",
  "fall_24": "Jodi's been stressed lately. I'm going to offer to watch Vincent for a day so she can get a break.$0#$e#Have a nice day, @.$4",
  "fall_25": "Sometimes I miss how busy I used to be back in Zuzu City with my corporate job.$2#$e#I have so much free time here in the valley. It allows me to focus on my hobbies.$3",
  "fall_26": "Spirits Eve is tomorrow, @! Will you be exploring the maze this year?$1#$e#Victor has a tendency to get lost in the maze. He always puts himself in rough situations.$2",
  "fall_28": "There's a dark story about the family that used to live in our house.$2#$e#I'm not allowed to talk to anyone about it.$6#$e#Yes, @. That includes you too.$2",
  
  //WINTER DIALOGUE
  "winter_1": "My, my. That snow storm last night blanketed the entire valley.$6#$e#Keep yourself warm, sweetie. I wouldn't want you catching a cold!$3",
  "winter_2": "I almost slipped on some ice today.$6#$b#Be careful when you're walking outside, sweetie.$2",
  "winter_3": "Winter is beautiful with the bright white snow and decorations.$3#$e#Gus, Pierre, and Mayor Lewis decorate the lamp posts around town.$1",
  "winter_5": "I've been trying to get Jodi and Caroline to come to the bathhouse with me.$1#$e#It'd be such a wonderful lady's night.$4",
  "winter_6": "It's great to take a break from working on %farm Farm during winter, isn't it @?$4#$e#Whether you want it or not, you deserve a break from crop work for a while.$3",
  "winter_7": "Hello, honey. Are you walking with all of us to the ice fishing spot tomorrow?$3#$e#I'd love to see you compete against Willy.$4",
  "winter_11": "My paint supplies come from the Fern Islands.$3#$e#Yes. They're expensive.$6",
  "winter_12": "Caroline and Jodi don't go out drinking too often at the saloon. Those two are always so busy.$2#$e#I enjoy our chats, sweetie.$1",
  "winter_13": "My mother and father are visiting in a couple days. Everything must be perfect!$1",
  "winter_14": "I'm visiting Blue Moon Vineyard tomorrow to order more wine from Sophia.$3#$b#I sometimes have Victor go, but I want to see the Gem Sea from the cliff. It's a beautiful view.$1",
  "winter_16": "I purchase all of my jewelry from Sautine City. Their jewelers are unrivaled in their craftsmanship and attention to detail.$4",
  "winter_17": "Although I retired at a relatively young age, I still dabble in stocks.$0#$e#I'm adept at making quick money from stock trading.$4",
  "winter_19": "I feel as if I'm starting to get sick. This winter has been unusually cold.$2#$e#I need to pay a visit to Harvey. We're fortunate to have an experienced doctor in the valley.$0",
  "winter_22": "I had our fireplace built by Robin. She's an exceptional carpenter, able to build just about anything.$1#$e#It's a pleasure to talk with you, @.$4",
  "winter_23": "Today has been a busy one. A good glass of wine is well deserved for my hard work today.$3",
  "winter_24": "Hi, @! Are you keeping yourself warm this winter? The Feast of the Winter Star is tomorrow.$3#$e#I got the perfect gift for my secret person!$4",
  "winter_26": "I ordered some wine from a vineyard located north from Grampleton. They gave me an extra bottle!$1#$e#I want to give this bottle to you, dear. Thank you for being a good friend![348]$4",
  "winter_28": "Spring is almost here, @! I need to hurry up and decide on what plants I'm going to grow in the backyard this year.$1#$e#Have a wonderful day, dear. Good luck cultivating your crops fields this coming season.$4"
}
