
{
  //SPECIAL DIALOGUE
  "Introduction": "Would you look at that? It's the new farmer everyone has been talkin' about. Finally moved to the valley I see.$1#$e#I've been workin' Fairhaven Farm here for many years. It ain't much, but it's honest work.$0#$e#You're Yoba darn lucky you got all that free land from your grandpa. I sure could use some more land to plant my crops.$2",
		
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "AndyHouse_9_6": "What in Yoba's name are ya doin'!? I'm in bed! Leave now!$7",
  "AndyHouse6_9_6": "Can't you see I'm in my bed? This is not the place to talk. Come back later, @.$5",
  "AndyHouse_18_6": "Snooping around my kitchen are ya? Don't go stealin' anything. I have my eye on you.$5",
  "AndyHouse8_18_6": "I'm making myself a meal using fresh forage from outside.$3#$e#Cindersap Forest has lots of healthy food if you know where to look.$1",
  "AndyHouse_9_16": "I better not find you lookin' through my manifest. My farm's financial situation is none of your Yoba darn business ya hear me?$2",
  "AndyHouse4_9_16": "%Andy is busy writing in his manifest.",
  "AndyHouse8_9_16": "A big part of my income comes from foraging around the forest.$3",
  "Forest_64_70": "Don't go snooping around my shipping bin.$5",
  "Forest4_64_70": "%Andy's busy putting produce and forage in his shipping bin.",
  "Forest8_64_70": "%Andy looks at you and smiles as he puts product in his shipping bin.",
  "ForestWest_58_22": "%Andy is staring at this abandoned vineyard...",
  "ForestWest_53_28": "%Andy is drinking and ignoring you. He looks depressed...",
  "SeedShop_37_22": "I'm happy to see you came to worship Yoba, @.$1",
  "SeedShop4_37_22": "If you want to worship Yoba with me, you're more than welcome to.$1",
  "SeedShop8_37_22": "I didn't always use to believe in Yoba. I came to my senses when I was in dire need of help.$2#$b#Yoba saved me. Leas' I can do is show respect.$1",
  "JojaMart": "Don't talk to me. I'm busy shoppin'. Can't you see that?$0",
  "JojaMart4": "Joja has the best and cheapest products. If I shopped at Pierre's I would go out of business.$2",
  
  //GENERIC DIALOGUE
  "Mon": "... Hi.$0#$e#What do you want?$2#$e#I'm not givin' you any of my seeds or crops.$2",
  "Mon2": "Hi, @. It's the start of a new week.$0#$e#I have a lot of farm work to get done today.$2",
  "Mon8": "Happy Monday, fellow farmer.$1#$e#Start of a new week means a start of a new load of work.$1",
  "Tue": "%Andy notices you but isn't saying anything.",
  "Tue2": "How's your farm work goin' on %farm Farm, @?$0",
  "Tue8": "I found some good forage today. I'll eat half of it and ship the rest.$1",
  "Wed": "I need to pick me up some food today. Question is, do I look for forage in the forest or buy it?$2",
  "Wed6": "You have some dirt on ya. That's a sign of a hard workin' farmer!$1#$e#Keep up the work, @.$0",
  "Wed10": "Hey there. You look like you're full of energy today. Mind sharin'?$3#$e#That was my attempt at a joke. I'm not that funny of a guy.$1",
  "Thu": "Uhh. Hello there.$0#$e#%Andy is now ignoring you.",
  "Thu4": "It's nice to see you, @.$3#$e#Have a great day.$1",
  "Thu8": "Hey there. Nice of you to speak to me.$3#$e#I have a lot of plannin' to do today.$0",
  "Fri": "If you wanna get on my good side, you should buy me a drink at the saloon.$0",
  "Fri2": "Finally, Friday. Now I can have a drink without feelin' guilty.$2",
  "Fri8": "I'll buy you a drink at the saloon sometime. All your hard work is deservin' of it.$3",
  "Sat": "%Andy sees you but chooses not to say anything.",
  "Sat4": "I slept in this mornin'. Felt like takin' it a bit easy today because it's Saturday.$1#$e#It's no excuse to slack off on my farm work though.$2",
  "Sat10": "We farmers don't got time to lollygag on the weekends. There's too much work to get done.$3#$e#Have a productive day, @.$1",
  "Sun": "I never see you durin' worship hours on Sunday. You don't believe in Yoba, do you?$5",
  "Sun2": "If you want to learn more about Yoba, consider comin' to worship on Sundays.$0#$e#Jodi, George and I are typically the only ones, but we could teach you a thing or two.$3",
  "Sun8": "I enjoy visiting the Yoba shrine on Sunday. It's a time of self-reflection and appreciation.$1#$e#Enjoy the rest of your day, farmer.$3",
  
  //SPRING DIALOGUE
  "spring_1": "Not now, farmer. Busy.$0#$e#%Andy is now ignoring you.",
  "spring_2": "Strawberries and potatoes are my crop of choice during spring.$0#$e#They bring me steady income.$3",
  "spring_3": "Spring onions sprout outta the ground on the paths outside my farm durin' this season.$0#$e#If I can grab several of 'em, I can make a meal using them!$1",
  "spring_5": "There was a Yoba darn crow eatin' my crops this mornin'. Blasted flying beasts.$7#$e#Sorry, farmer. Not in a good mood to talk.$2#$e#I said not now.$5#$e#%Andy is now ignoring you.",
  "spring_6": "Only people I get along with well in Pelican Town are George and Pam. Not many people understand me. Maybe it's the age difference.$0#$e#What about Mayor Lewis? That Yoba darn man is a fool if I've ever seen one. Him and I don't meet eye to eye.$2",
  "spring_7": "Fairhaven Farm prides itself in supplying a lot of 'em forage to the surroundin' provinces.$0#$b#George in particular buys all my leeks.$3#$e#George loves leeks, @. If you wanna get on his good side, give him a leek or two. You'll see that face of his beamin'.$0",
  "spring_8": "Livin' in Stardew Valley is the great Ferngillian dream. Beautiful land, natural resources, good people... mostly.$0#$b#What more could someone ask for?$1#$e#Well, I could use more money and land...$2",
  "spring_9": "Found me a hefty number of dandelions, leeks, and horseradish's in the forest this morning. I wager these will fetch a modest price.$1#$e#There's always forage to find in the forest, @. You should try looking around.$1#$e#Just don't take all of it.$2",
  "spring_10": "Bought a new axe from Clint yesterday. I broke my copper one cutting down some trees in this here forest.$0#$e#Upgrading your tools is important, @. Let this be a lesson for ya.$0",
  "spring_11": "Sprinklers are amazin' if you want automation on your farm. Fairhaven Farm is a bit too small to utilize such devices though.$0#$e#I don't mind manually waterin' my crops. I actually enjoy it.$0",
  "spring_12": "You participatin' in the egg hunt tomorrow, @?$3#$e#You should do the right thing and let Vincent or Jas win. That's what I would do.$0#$e#I don't understand why you, Sam, and Abigail participate. It's unfair to the kids.$2",
  "spring_14": "Several of my crops aren't doin' so well this season. I need to order more Joja fertilizer.$2#$e#Bye, farmer.$2",
  "spring_15": "I have a steel hoe Clint crafted for me. He's an expert in his trade.$0#$e#The upgraded hoe helps me save time on my farm work.$1",
  "spring_16": "I haven't found much forage in the forest today. Is someone else taking everything?...$2#$e#%Andy is staring at you.",
  "spring_19": "I go to the saloon every Friday night. It's important to reward hard work when earned.$1",
  "spring_20": "Marnie let me use her seed maker and I was able to turn my low-quality produce into a lot of seeds.$1#$e#I need to get me one of those machines soon. It'd save me a lot of money.$2#$e#Woodcrafters in Grampleton sell 'em for 6,000G. Expensive, but may be worth the gold in the long run.$0",
  "spring_23": "We're goin' into the forest tomorrow for the Dance Festival, farmer. I know my way in and out with my eyes closed.$1#$e#Maybe I'll find some good forage on our way there.$3",
  "spring_25": "Mayor Lewis and I had a disagreement yesterday. I have a strong feelin' he doesn't like me right now.$2#$e#What was it about? None of your Yoba darn business.$2",
  "spring_27": "Hey there, farmer. Do you know what you'll be plantin' for the next season? I'll be plantin' corn and tomatoes.$0#$e#See you around, @. Keep up the good work.$0",
  "spring_28": "I heard on the news the summer heat this year will be more intense than an egg on a skillet.$0#$e#Make sure your crops are watered thoroughly, @. Wouldn't want your crops dyin'.$2",
  
  //SUMMER DIALOGUE  
  "summer_1": "On days like this I wanna find a nice tree and read passages from my Yoba text.$1#$e#Passage 13:2C is one of my all-time favorites. It teaches strong life lessons.$0",
  "summer_3_1": "That Yoba darn sound last night woke me up! What in tarnation was that!?$5",
  "summer_3": "Blasted bee stung me today! Next time I need to put on my gloves when harvesting that honey.$2",
  "summer_5": "Pierre doesn't sell any of my crops or forage in his store. I don't get along with him because of that.$2#$e#Oh, why doesn't he? Because. He isn't a good shop owner. Why else.$2",
  "summer_7": "Let me know if you want to borrow my Yoba Text. I have detailed notes on the most popular passages.$3#$e#What? You don't want to borrow it? Fine.$2",
  "summer_8": "You can always rely on corn for steady and slow profit because they last for two seasons.$1#$e#This the reason I plant corn during the summer season. Helps me save on those seed expenses.$0",
  "summer_9": "I found some spice berries growin' on the other side of my fence this mornin'.$1#$b#The benefits of havin' a farm in this here forest are beneficial.$0#$e#Have a nice day, farmer.$0",
  "summer_10": "I'm puttin' some iridium quality spice berries in that soup tomorrow. It'll add just the right amount of spice to it!",
  "summer_14": "I lost two crops this morning to some Yoba darn crows. I need to do somethin' bout that.$2",
  "summer_16": "Havin' a lot of dirt on ya is a showcase of a hard workin' farmer.$0",
  "summer_18": "I have a steel hoe Clint crafted for me. He's an expert in his trade.$0#$e#The upgraded hoe helps me save time on my farm work.$3",
  "summer_22": "I caught a glimpse of %farm Farm the other day. You've been makin' progress cultivating it, @.$0#$e#Keep up the good work, farmer.$3",
  "summer_23": "There's good forage up at the summit. I reckon you could earn quite a bit of quick gold.#$e#It's too steep of a hike for me to go up there. You're healthy and young enough for that hike, @.$3",
  "summer_24": "I need to take a trip to Grampleton soon and have one of them woodcrafters make a new bee house for me.$0#$e#I don't have much experience in craftin' my own.$0",
  "summer_26": "Joja sent me a letter with coupons in it. I get 5 percent off my next purchase!$0#$e#It sure made my day.$3",
  "summer_27": "I found a hefty amount of forage in the forest today. With what I found; I reckon I'll be making profit this season.$1#$e#Have a wonderful day, farmer!$3",
  "summer_28": "Those jellies are showin' up tonight at the beach. You joinin'?$0",
 
  //FALL DIALOGUE 
  "fall_1": "Fall is a good opportunistic season, @. There's mighty number of mushrooms ripe for the pickin'.$0#$e#Don't go foragin' all of 'em. Save some for me.$2",
  "fall_3": "I was workin' my crop field yesterday and I saw some military men walk over to the Wizard's Tower.$2#$b#Those scummy government officials are still tryin' to recruit witches and wizards for their war.$5#$e#Pfft. Despicable.$2",
  "fall_5": "There used to be more farms in the valley before the great recession. Those who couldn't adapt went out of business.$0#$e#I used to have more friends in the valley...$0#$e#%Andy is ignoring you. He looks sad.",
  "fall_6": "Good day, farmer. I hope this season is treating you well.$0#$e#Good luck on %farm Farm. You're doing this here valley proud.$0",
  "fall_9": "I found several purple mushrooms in the forest this mornin'.$1#$e#They were of a high quality too! I reckon they will fetch a good price on the market.$3",
  "fall_10_1": "That Sophia girl at the vineyard took over after her parents-$0#$e#Ack, nothin'. You'll need to talk to her about it.$2#$e#You have a good day, ya hear?$0",
  "fall_15": "I'll have my own grange display tomorrow, farmer. Worry not, I don't plan on winnin'.$0#$e#I've never won once; I don't think that'll change tomorrow...$2",
  "fall_18": "I seen you walkin' in that there Adventurer's Guild in town. You one of those monster hunters?$0#$e#That's some dangerous work. I'm thankful you're willin' to put your life on the line for folks like me, keepin' this here valley safe.$1#$b#Thank you.$0",
  "fall_19": "I harvested several high-quality crops this mornin'. That Joja fertilizer works like a charm every time.$3#$e#I recommend using Joja fertilizer, @. It'll give you more profit.$0",
  "fall_21": "I don't turn my crops into artisan goods such as beer or wine. Fairhaven prides itself in supplying raw crops.$0#$e#You have a good day, farmer.$0",
  "fall_23": "Cindersap Forest is pretty this time of season. It's one of the reasons I choose to live out here, cultivating my land.$3#$e#Have a nice day, farmer.$0",
  "fall_25": "%Andy notices you and waves with a smile. He looks busy.",
  "fall_27": "Pierre shares his spiced pumpkin cider during Spirits Eve.$3#$e#He only shares it with his 'close' friends.$2#$b#It's nice I'll get to taste some of it after an entire year.$0",
  "fall_28": "Crops are gonna start dyin' soon, farmer. Winter is upon us.$0#$e#I'll see you around, now.$0",
  
  //WINTER DIALOGUE  
  "winter_1": "Winter is my favorite season. It allows me to focus on my foraging hobby instead of managing Fairhaven Farm.$1",
  "winter_2": "Winter is a mighty fine season to spend time foragin' around the forest. No crops or bee houses to manage!$1#$e#I imagine you appreciate the extra time too, @.$0",
  "winter_4": "Sleepin' in during winter is a luxury I can afford durin' this season. Not much work to be done around the farm.$0#$e#I see you walkin' up to those mines. You fighten' those monsters?$2#$e#Good luck to ya. There are dangerous cretins in those mines.$0",
  "winter_5": "Tell me. Do you think that Olivia lady takes an interest in me? I see her spotting me at the saloon sometimes.$3#$e#Maybe I should say hi one of these days.$2",
  "winter_6": "Pam had six drinks last night at the saloon. I don't think she's doin' too well. I should check on her.$2#$e#She usually only has four or five drinks. Somethin' is up.$0",
  "winter_7": "We're gonna be walkin' to that ice fishin' spot in the forest tomorrow, @. I'll be leadin' the way.$1#$e#I know my way in and out of the forest very well. I go in there to forage all the time.$0",
  "winter_9": "I dug up several winter roots and snow yams today in this here forest. These will fetch a nice price on the market.$1",
  "winter_11": "It's Yoba darn freezin' today. Stay warm, farmer.$0",
  "winter_12": "Too many people these days speakin' nonsense and bein' disrespectful to us older people.$2#$e#I gotta say, I appreciate you act your age instead of your shoe size.$0#$e#You have a great day, @. Keep up the good work on %farm Farm.$0",
  "winter_14": "I recently read a passage in my Yoba text that enlightened me, @: 'Think not ill of others but help them overcome'.$0#$e#There are amazin' lessons to be learned in this here book. I recommend readin' it.$1",
  "winter_16": "Ever tried that Blue Moon wine before? I'm not particularly fond of wine, but Sophia does a good job makin' it.$0",
  "winter_17": "I sometimes see flashy lights comin' from the Wizard's Tower at night. I wonder what he be doin' in there.$2",
  "winter_19": "I'll never understand how Susan can live right by those there railroad tracks up in the mountain.$2#$b#Those Yoba darn trains would keep me up every night.$2",
  "winter_21": "My drink of choice is Grampleton wheat ale. It's the finest craft beer you'll find in the region.$1#$e#It'd taste even betta' if they used Joja fertilizer.$2",
  "winter_24": "I dislike this time of year. It's a grim reminder to me I don't hold anyone special in my life.$2#$e#I'm not lookin' for your Yoba darn sympathy, farmer.$5#$e#%Andy is now ignoring you.",
  "winter_26": "Pierre still refuses to sell my crops in his store, and he wonders why I never shop there.$2#$e#...$2#$e#%Andy is ignoring you. He isn't in a good mood.",
  "winter_27": "Joja sent me several coupons in the mail this mornin'. They treat loyal customers with great care.$1#$e#I need to go to the library and use one of those “computers”. Needa use their website.$2",
  "winter_28": "Are you prepared to plant your crops this season, farmer?#$e#Good luck to ya! I'll be doin' the same.$1",
}
