
{
  //SPECIAL DIALOGUE
  "Introduction": "Oh, hey there! You're the new owner of %farm! I'm Victor. It's a pleasure to meet you, @ is it?$1#$e#Good luck clearing out the debris. That old farm hasn't been used in forever.$0#$e#Weren't you an accountant in a city? Why would you quit a high paying job to till dirt for a living?$0#$b#The economy for farming isn't that great for local farmers with Joja buying up rights everywhere in the country.$6",
  "divorced": "@... you... you broke my heart. I put my life into you and you... do this to me?$2#$b#Please...#$b#Tell me what I did wrong. What did I do? Did I hurt you?$2#$b#@, please...$2",
  "secondChance_Boys": "You want to give our relationship another go, @?$6#$b#I'm not so sure about this...$2#$b#You really hurt me when you divorced me, @. I should take more time to think about this, but...$2#$b#I want to give us another chance too!$3#$b#I feel like we can both learn from our mistakes last time and have a healthy relationship.$4#$b#This will require effort on both sides. I believe we'll make this work.$3",
  "dumped_Boys": "@, don't talk to me...$2#$b#We are not friends. Not after what you did...$2",
  "stardrop_gift": "Hey there, sweetie. I bought this stardrop fruit for you.$4#$b#It came all the way from the Fern Islands! It's fresh from a healthy Cellstar tree.$1#$b#I love you, honey.$4",
  "give_flowersA": "You want to date me, @? I feel the same way! I was a bit too nervous to make the first move.$4#$b#I'm happy you did, @. You just made me the happiest person alive!$1",
  "give_flowersB": "I didn't know you felt the same way, @. This makes me so happy!$4#$e#I'm a bit nervous, aren't you?$4",
  "give_pendant": "!!!$7#$b#You... you want to get married? Is this you proposing to me, @!?$7#$b#I accept! I can't imagine living without being with you. I'll let Mayor Lewis know. Oh, I need to let my mom know too!$1",
  "rejectNPCA": "Uhh... no thanks, @.$0",
  "rejectNPCB": "I don't feel the same way, @. I'm sorry.$2#$e#What else do you want me to say? I said no.$0",
  "reject_two_heartA": "@, I don't like you that way. I don't mean to disappoint you.$2",
  "reject_two_heartB": "I don't think it's a good idea for us to date, @.$0#$e#I don't know you well enough.$0",
  "reject_four_heartA": "I'm not ready for a commitment like this. I'm sorry, @.$2#$e#I said I'm not ready.$5",
  "reject_four_heartB": "@, I... really like you but...$2#$b#I don't think I'm ready to date you. I'm sorry.$2",
  "engageA": "Uhh... I'm going to pretend you didn't just do that.$0#$e#Leave me alone, @.$5",
  "engageB": "Are you trying to cheat on your spouse with me!? What's wrong with you?$5#$e#You're disgusting. Get away from me.$5",
  "marriedA": "@? What are you doing? What would your spouse see if I told them you just tried this on me?$5#$e#I won't tell your spouse. Please. Just... stop.$2",
  "marriedB": "You want to marry me? You're already married, @. Please stop.$2#$e#@. Are you drunk or something? Go away before I tell your spouse.$0",
  "refusal_knownA": "I think we need to spend more time together before we can move on to this step, @.$6#$e#Sorry. I didn't mean to bring down your mood. It's important I'm transparent about this.$2",
  "refusal_knownB": "It's a little too early for this, don't you think?$0#$e#I appreciate the thought, @.$6",
  "refusal_botherA": "Uhh... It's still a no, @. Sorry.$0",
  "refusal_botherB": "Perhaps some day.$1",
  "refusal_no_heartsA": "That looks pretty. Did you buy it from a ghost on the beach?$0#$b#I've read books about mariner ghosts that sell mermaid pendants.$6",
  "refusal_no_heartsB": "So. Here's what's going to happen, @. I am going to walk away and pretend you didn't do that.$0",
  
  //EMPLOYMENT QUESTION - SPRING YEAR 1 ONLY
  "spring_Wed_1": "It's been sometime since I graduated from Pellcar University.$6#$b#My mother has been nagging me every other day to get employed somewhere. Anywhere.$2#$e#I understand I need to find a job but... I just... I need more time.$2#$q 1001/1002 jobquestion_followup#Do you think I'm lazy because I haven't found a job yet?#$r 1001 50 jobquestion_no#You aren't lazy, Victor. You need more time to decide what you want to do. Look at me! I didn't know what I was doing until recently.#$r 1002 0 jobquestion_neutral#You could try seeking out a part-time internship to see if it's something you like. At least your mom would get off your back?#$r 1002 -125 jobquestion_yes#I wouldn't call it lazy but... you've been out of school for over a year, Victor.",
  "jobquestion_no": "That's right. You used to work in accounting at Joja. You completely switched gears and became a farmer.$3#$b#Your story gives me hope for the future, @. Thank you.",
  "jobquestion_neutral": "I could possibly look into that. Feel out the work environment. See if I enjoy it.$6",
  "jobquestion_yes": "Hmm... I see. You're right. I need to apply myself more.$2",
  "jobquestion_followup": "$p 1001#I need to apply myself more to my dreams.$1|I need to ponder to myself for a while, @. Thank you for the chat.$6",
  
  //ZUZU CITY QUESTION
  "summer_Thu": "I've been thinking of my life back in Zuzu City. It was so... chaotic and noisy.$0#$e#Living here in the valley is certainly quite different from the city life.$1#$q 3001/3002 city_followup#Do you miss living in Pine-Mesa City?#$r 3001 15 city_yes#I sometimes wish I could go back to the city...#$r 3002 15 city_no#I miss being in close proximity of my parents, but living here in the valley has been so wonderful. I don't think I could go back.",
  "city_yes": "Not surprising. Cities have all the jobs. Unless you're willing to be self-employed it's difficult to make a living out here.$0",
  "city_no": "I have some family in Zuzu City too. My mother and I take trips to visit them on some occasions.$3",
  "city_followup": "$p 3001#I appreciate our chats, @.$1|I appreciate our chats, @.$1",
  
  //SPECIFIC MAP AND COORDINATES DIALOGUE
  "JenkinsHouse_31_5": "Uhh... this is a little weird, @. Can't you see I'm in bed?#$b#Please leave my room. Now.$5",
  "JenkinsHouse6_31_5": "Hey, @. Uhh... I'm kinda in bed right now? Would you mind leaving?$2",
  "JenkinsHouse_6_8": "I'm in the middle of brushing my teeth right now. Please leave.$0",
  "JenkinsHouse6_6_8": "Hi, @. Now isn't a good time to talk. I'm brushing my teeth at the moment.$3",
  "JenkinsHouse_28_8": "Greetings, @. I'm in the middle of swapping out this NC 150 graphic card.$3",
  "JenkinsHouse_35_9": "What book should I read? So many choices.$3#$e#I think I'm going to go with 'The Mysterious Gem Sea'!$1",
  "JenkinsHouse4_35_9": "Perhaps I should try reading a chapter or two of 'Game of Chairs'?$0#$b#My mother says it's an astonishing book with an incredible story line.$3",
  "JenkinsHouse8_35_9": "If you haven't read it already, I highly recommend reading Game of Chairs!$1#$e#I just got to a part of the story where someone named John Ice got betrayed by his own men.$7",
  "SeedShop2_13_27": "My mother sent me to pick up some food from Pierre's. It's the least I can do to help out.$6#$b#Pierre's quality of food is far better than what you could buy at Joja.$0",
  "SeedShop4_13_27": "Organic olive oil. Check. Organic flour. Check. Organic tomatoes. Check.$6#$e#OH! Hey, there @. I was just mumbling to myself there.$7",
  "SeedShop8_13_27": "Pierre has so many wonderful organic options to choose from!$1#$e#Are you here to buy some seeds, @?$3",
  "BlueMoonVineyard": "Quite the view of the Gem Sea from up here.$0#$e#Sophia has the best view in-town.$3",
  "BlueMoonVineyard8": "You can really lose yourself in thought when gazing out at the ocean on this ridge.$3",
 
  //GENERIC DIALOGUE
  "Mon": "Hey there, @. How's this Monday treating you?$0#$e#I need to write a lot of emails today. I'm not looking forward to it.$2",
  "Mon4": "I'm happy to see you, @! I'm in the middle of reading a book about mysterious sightings in the Gem Sea.$3#$b#This book has been in my family for a long time!$1",
  "Tue": "*Sigh*... Tuesday. This is the day where I need to do laundry.$2",
  "Tue8": "How's your day, @? Do anything productive?$1#$e#I may resume my project later.$1",
  "Wed": "I discovered a note today in our library. My mom has notes on Gotoro wine storage techniques.$2#$b#She could get in trouble if the wrong people found out. It's banned material in the Ferngill Republic.$0#$e#Don't tell anyone I told you this, @.$6",
  "Wed6": "Hi, @! I'm having an excellent day today. I hope the day is treating you well.$3",
  "Thu": "Have any plans today? I think I may continue work on a project I'm in the middle of.$0",
  "Thu6": "It's good to see you, @. I accomplished a lot today! I hope you did too.$1",
  "Fri": "Hi, @. Thinking about going to the saloon tonight? I may catch you there!$1",
  "Fri4": "We should get a drink together at the saloon, or play some co-op Prairie King tonight!$1",
  "Fri8": "I think I may have a glass of Blue Moon Vineyard wine tonight.$3#$e#Gus always keeps a good stock of it at the saloon.$1",
  "Sat": "So, are you enjoying living in Stardew Valley?$0#$e#Oh? Me? I think I prefer Zuzu City. But maybe the valley will age on me.$0",
  "Sat2": "Although it's the weekend, I have a ton of work to do today.$2#$e#It's what I get for procrastinating.$0",
  "Sat8": "I have a lot of free time today. Should I start a new book? Or perhaps return to my save file in my video game?$0#$e#I think I may play some games!$1",
  "Sun": "Uhh. Hi.$0#$e#Nice day today, isn't it?$0#$e#...$0",
  "Sun2": "Greetings, @! I hope the day is treating you well.$0",
  "Sun6": "It's a pleasure to see you, @. Have any plans for today?$1#$e#Me? I think I may continue my play through of the Legend of Lonk. I'm stuck in a dungeon right now.$0",
  
  //SPRING DIALOGUE
  "spring_Tue": "Oh. Hey, @. There's quite a bit on my mind right now.$2#$e#Sorry. I don't feel like talking.$2",
  "spring_Tue4": "Sigh... I have chores to do today. I'm not looking forward to it.$2",
  "spring_Tue8": "Hey, @! How's work going on %farm Farm?$3#$e#That's good to hear!$1",
  "spring_Thu": "Ugh... I need to go to Pierre's for groceries soon. I don't know why my mother doesn't just hire a butler already.$6#$e#Hey, are you thinking about a part time job?$1",
  "spring_Thu6": "I wonder what I should pick up at Pierre's during my next trip?$0#$e#I'm thinking spaghetti ingredients!$1",
  "spring_Sun": "My mother and I moved to Stardew Valley from Zuzu City about a year ago. The valley is...$6#$b#Quiet compared to the urban environment I used to be in.$3#$e#You used to live in Pine-Mesa City right? You can understand what I mean.$1",
  "spring_Sun8": "There are eight bridges in Stardew Valley. Over half of those are in Pelican town.$3#$b#There are also many small wooden makeshift bridges everywhere, such as the one at the beach.$1#$e#It's incredible that bridges can allow different communities to connect with one another.$1",
  "spring_3": "My seamstress in Chestervale made this shirt for me. I always custom order my clothes from her.$3#$e#This shirt in particular cost 8,000G.$1",
  "spring_5": "Hey, I'm in the middle of something.$6#$e#...$0#$e#Uhh... here. This'll buy you a game of Prairie King.[384]",
  "spring_8": "I accidentally dropped one of my mother's fancy wines yesterday...$2#$b#I had to spend a tiny portion of my allowance to buy another iridium quality bottle at Blue Moon Vineyard from Sophia.$6",
  "spring_10": "My mother was a senior accounting manager at Joja's International Shipping Branch.$3#$b#She received a lot of money and bonuses at her job, then made even more when she cashed out her stocks with the company.$1#$e#She does daily stock trading now. I can't see myself trading stocks.$0#$b#Stock trading sounds a bit unfulfilling in my opinion.$2",
  "spring_12": "The Egg Festival is tomorrow, @. Abigail is an absolute beast at finding eggs.$6#$e#I heard Mayor Lewis is considering banning her because she keeps winning.$0#$b#Don't tell Abigail I said that!$7",
  "spring_15": "I was playing Journey of the Prairie King a couple days ago and almost beat it.$1#$b#Apparently, if you beat the game, there's a chance you'll get the arcade machine delivered to you.$3#$b#If I really wanted it, I'd just buy it though.$0",
  "spring_20": "Andy got too drunk at the saloon last night. He dropped his beer glass and it shattered on the floor.$0#$b#He walked out and left his mess. Emily had to clean the floor and she accidentally cut herself.$2#$b#I don't understand that guy.$5",
  "spring_21": "I can't fathom what it must be like to be in Andy's shoes.$2#$b#Have you seen his farm or his house? I hope you don't become like him, @.$6",
  "spring_23": "The Flower Festival is tomorrow. I love the part of the woods we go to for it.$3#$e#I wonder if Sophia is bringing her iridium quality wine?$0",
  "spring_26": "I received an email today with a job offer from a good reputable architecture company.$6#$b#The problem is that... it's all the way across the country and I'm not comfortable traveling that far away.$2#$e#I'm not sure that's what I want my career to involve.$2",
  "spring_27": "Hi, @. I'm just pondering to myself at the moment.$6#$e#I umm...$2#$b#sometimes I... feel like people are nice to me just because I'm wealthy. It's hard to trust people.$2",
  "spring_28": "Summer can't come soon enough. I'm looking forward to going to the beach more often.$1",
  
  //SUMMER DIALOGUE
  "summer_Wed": "Uhh. Hi, @.$0",
  "summer_Wed2": "Hi, @. How is this summer heat treating you?$1",
  "summer_Wed4": "Sebastian played some amazing chords on his synthesizer the other day.$1#$b#I think I may get into piano so I can play with him and the others.$3",
  "summer_Wed8": "It's great to see you, @. I hope you're having a productive day today!$1#$e#Oh, me? I'm trying my best to stay cool in this summer heat.$3",
  "summer_1": "Summer in Stardew Valley is great. It's not too warm and not too cold.$3#$e#It's perfect.$1",
  "summer_3_1": "Did you hear that explosion last night? Joja blew up the rocks blocking Susan's house.$6",
  "summer_6": "...Sorry, @. I have a lot on my mind today. I'm not exactly in the best mood.$2#$e#Can you leave me alone?$2#$e#@... I'm serious.$5#$e#...$5#$e#You know what? Here's a chunk of money. Go buy yourself a couple drinks and leave.[336]$2",
  "summer_8": "This summer heat is crazy this year. Good thing we have a high powered AC in my house.$0",
  "summer_9": "Hey, @. You're part of the Adventurer's Guild, right? I've seen you walking into the Adventurer's Guild building quite a bit.$0#$b#Only travelers from Castle Village go in there.$6#$e#I must say, it's impressive and brave of you to combat monsters while at the same time, cultivating your farm. It is admirable.$1#$e#Me? I'd never fight monsters. I don't fancy myself getting hurt or even worse.$2",
  "summer_11": "My mother and I pour in some of our best wine into the adult food pot for the Luau.$1#$e#It only takes one bad ingredient to ruin all of the soup. Be careful what you put in it, @.$2",
  "summer_12": "From time to time, I reminisce of when I was attending Pellcar University in my engineering program.$6#$b#Life was so simple back then.$2#$e#No one told me 'adulting' would be like this. You're off on your own with no one to guide you.$0",
  "summer_16": "Most of our furniture was hand crafted in Grampleton.$3#$b#The woodwork artisans there are some of the best in the world.$1",
  "summer_15": "I heard on the news the Ferngill Republic Investigative Agency wants to clear cut forests here in Stardew Valley.$5#$b#The agency strongly believes they can find magical artifacts that will turn the tide of war with the Gotoro Empire.$0#$e#That wizard in the tower isn't allowing them to proceed.$6",
  "summer_16": "Hmm... I need to think about what I need to do today.$0",
  "summer_17": "I worked on a complex math problem for a chunk of my day today.$0#$e#I'm happy to say I solved it. I always welcome an intellectual challenge!$1#$e#I do enjoy our chats. Have an excellent day, @!$1",
  "summer_20": "I tipped Gus 800G for my drink the other day.$6#$b#The saloon isn't doing that well financially because some people aren't paying their tabs.$2#$e#I think it's because of Pam and Andy...$6",
  "summer_21": "Abigail suggested the other day I learn an instrument so I can play with her, Sam, and Sebastian.$0#$e#I may take her up on that. I do fancy the pianist C. Chaplin.$3",
  "summer_23": "There's part of a dwarfish novel I just recently finished that described the ancient cities of the dwarves in the Cascadian Mountain range.$1#$e#These cities were once huge hubs of commerce for the ancient dwarfish people.$7#$b#To this day, we still don't know that much about them...$2#$b#We find their gadgets here and there and know some of their history, but that's really it.$0#$e#I'll see you around, @.$3",
  "summer_26": "Did you know that a huge part of the Ferngill Republic Industrial Revolution was because of dwarfish technology?$1#$b#Scientists were able to replicate their gadgets and modernized them for human applications.$3#$e#Talk to you later, @.$3",
  "summer_27": "I was at Pierre's a couple days ago and I saw Susan buy over 200 bags of seeds.$6#$b#I believe she's preparing for the next season.$3#$e#I'll see you around, @.$3",
  "summer_28": "Moonlight jellies are some of the most beautiful aquatic creatures in the Gem Sea.$3#$b#I look forward to seeing them each year.$1",
  
  //FALL DIALOGUE
  "fall_Sat": "The homeless person that lives in the tent in the mountains looks familiar to my mother.$0#$e#She thinks she has seen him somewhere else before. Weird, right?$0",
  "fall_Sat8": "It's a chilly day today. Keep yourself bundled up, @.$1",
  "fall_1": "Fall is finally here, @. The colors of this season are beautiful.$1",
  "fall_2": "I'm reading a book called 'Legends of the Dwarves'. It's about several mountain ranges the dwarfish race used to live in and their advanced ancient technology.$3#$b#One of those mountain ranges is the one here in Stardew Valley, Corneal Mountain!$1",
  "fall_5": "The family that lived in our house before us allegedly had bad relations with Mayor Lewis.$0#$e#My mother knows, but won't tell me.$6",
  "fall_14_1": "I ran into Sophia the other day when I walked up to Blue Moon Vineyard to get a good view of the Gem Sea.$6#$b$She was... crying and didn't want to talk. I hope she's doing okay.$2",
  "fall_10": "I'm currently having a dilemma with some aspects of code I'm working on. It has to do with a syntax error.$0#$e#I love troubleshooting problems. It just means there's something to fix and work towards.$1",
  "fall_12": "I'm going to visit Sophia tomorrow at her vineyard.#3#$b#I'll also use this as an opportunity to purchase more of her iridium quality grape wine.$1",
  "fall_13": "I saw Marlon with several monster hunters from Castle Village the other day. I could have sworn I also saw the Wizard with them too.$0#$e#I think they were having a secret meeting or something.$6",
  "fall_15": "Hey, @. Are you looking forward to the Stardew Valley Fair tomorrow?$3#$b#You're setting up a grange display right?$0#$b#Well, good luck! I'm positive you'll do great.$1",
  "fall_17": "I saw Linus walking around Pelican town last night, I felt bad for him, so I offered him 1,000G.$2#$b#He... turned it down. He said something about him not needing it because this valley offers everything he needs.$0#$e#I don't know what Linus meant by that. Maybe he's just crazy.$6",
  "fall_21": "It's good to see you, @. I feel like taking a hike up to the summit tomorrow.$1#$b#The view up there is amazing during this time of year.$3",
  "fall_23": "Maru helped me solve a calculus problem yesterday with my project. She has a very different way of approaching things.$3#$b#Very resourceful!$1#$e#Have a nice day, @.$3",
  "fall_24": "My mother enjoys collecting extravagant wine from across the world. Maybe if you become close friends with her, she'll give you some.$1#$e#Don't be obvious like that Pam lady though. It's just... a little sad how hard she tries.$2",
  "fall_25": "My mother picked up painting as a hobby some several years ago.$0#$b#She has made a lot of progress in her artistic skills.$3#$b#It really goes to show that practice makes perfect.$1#$e#Just look at how much you've learned from when you started farming!$1#$e#I hope you have a great day, @.$3",
  "fall_26": "Spirits Eve is my favorite festival. I wonder how difficult and scary the maze will be this year.$1#$e#The wizard uses magic to summon the maze. It makes you wonder what else he could do.$0",
  
  //WINTER DIALOGUE
  "winter_Wed": "I sure could go for a peppermint coffee.$3#$e#If there's anything I enjoy about winter, it's the seasonal food and drinks.$1",
  "winter_Wed8": "Hi, @. We should grab a peppermint coffee together sometime.$1#$b#I'll pay for your coffee! Gus uses organic peppermint candy.$3",
  "winter_1": "That was quite the snowstorm we had last night. I can't see a single blade of grass anywhere.$6#$e#Be sure to bundle up and stay warm, @.$3",
  "winter_4": "Ever wonder what the elves were like? I'm reading a book about them.$1#$b#They used to be the most prominent race on the planet until they went extinct. No one knows why though.$0",
  "winter_7": "Are you ready to make the trek into the forest tomorrow for the ice fishing festival, @?$0#$b$I enjoy walking with everyone to the location it's held at in Cindersap Forest.$1#$e#It gives me an opportunity to strike up conversation with Sophia and Sam.$3",
  "winter_9": "I'm building a computer for a person in Chestervale, the same city where I get my clothes tailored.$3#$b#He has a lot of RAM in his build. Probably doing a lot of processes where memory is requested immediately.$0#$e#Building computers is a hobby of mine! I'm happy some people seek me out to put together components for them.$1",
  "winter_13": "I've been procrastinating on my coding project. Perhaps I should get back into it today?$0#$e#It's always a pleasure to see you, @. Have a nice day.$3",
  "winter_4": "Hi, @. I'm feeling great today! Let me share that feeling with you.$3#$b#Here's some gold![384] [384] [384]$1",
  "winter_17": "My mother bought some magical totems from someone in a blue cloak at the market last night.$3#$b#That person looked strangely familiar...$0#$e#I think that might be the Wizard from 'The First Slash' at the Fern Islands.$1",
  "winter_18": "The game developer of Journey of the Prairie King, ConcernedMonkey, is making another game!$1#$b#Given how amazing JPK is, I must say I am absolutely looking forward to playing it.$3",
  "winter_20": "When I was attending university, there was a professor teaching my advanced physics class named R. Peterson.$3#$b#He used to work closely with a wizard at the Fern Islands archipelago.$1#$b#You'd be amazed with how the laws of physics are applied to all things magic.$7",
  "winter_21": "I designed a prototype trestle bridge for fun in a program I wrote. These types of bridges are useful if you need to cross over marshes or shallows.$1#$e#Trestle bridges are cheaper to build than other types of bridges because they use wood instead of stone or steel.$3",
  "winter_23": "My mother made 80,000G last night from a stock trade. I think she's going to spend it on expensive wine again.$0",
  "winter_24": "I wonder who my secret gift giver is this year for the Feast of the Winter Star.$0#$e#I hope it's Sophia!$1",
  "winter_27": "*Sigh*... I've had a rather rough day today. Playing some video games would be a great way for me to unwind a bit.$2",
  "winter_28": "Winter is almost over. I can't wait to spend more time outside and enjoy the weather.$3"
  }
